{
  "basics": {
    "name": "Cheng CHEN",
    "label": "AI Researcher",
    "image": "",
    "email": "cheng.chen25@imperial.ac.uk",

    "url": "https://github.com/ChefsSalad",
    "summary": "My work is dedicated to the deep exploration and practical application of frontier AI technologies. I focus specifically on Multimodal AI and Language Modeling, aiming to bridge data types (e.g., text, vision, audio).",
    "location": {
      "address": "SW7 2AZ",
      "postalCode": "SW7 2AZ",
      "city": "London",
      "countryCode": "UK",
      "region": "United Kingdom"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "ChefsSalad",
        "url": "https://github.com/ChefsSalad"
      }
    ]
  },
  "work": [
    {
      "name": "Artificial Intelligence Quantitative Research Lab",
      "position": "AI Intern, Research Leader",
      "url": "",
      "startDate": "2025-02-01",
      "endDate": "2025-08-01",
      "summary": "Led research and development of quantitative trading strategies using AI. Designed a multi-agent financial model, fine-tuned language models for sentiment analysis, developed a heterogeneous information fusion engine, and created a comprehensive backtesting framework.",
      "highlights": [
        "Designed and validated a highly integrated Multi-Agent Financial Model, with strategies covering diverse assets including China market futures, options, cryptocurrencies, and stocks, effectively enhancing portfolio risk dispersion and alpha generation in complex markets.",
        "Fine-tuned diverse language models to perform financial semantic quantification for sector classification, topic modeling and net sentiment analysis on Multi-Source text.",
        "Developed a Heterogeneous Information Fusion Engine utilizing an Attention Mechanism (KQ Module), integrating news, search behavior, and social media into the prediction system to enhance market sentiment capture and improve prediction accuracy and robustness.",
        "Led the development and high-level encapsulation of a Multi-Agent Framework, Data Pipeline, Visualization, and Backtesting system, creating unified, modular interfaces that significantly accelerated the strategy iteration speed from concept to live trading.",
        "Designed and trained an AI Classification Model based on Classical Wave Theory to precisely identify all five impulse waves and three correction waves in K-line charts, successfully establishing a structured, high-win-rate trading strategy.",
        "Integrated a tail-risk indicator (VIX spillover intensity) to implement real-time, dynamic weight adjustments for the Minimum Connectedness Portfolio (MCP).",
        "Conducted research on Adaptive VWAP Multi-Scale Order Splitting Strategies and Automated Feature Factor Screening, optimizing large-scale order execution and feature selection."
      ]
    },
    {
      "name": "Institute of Computing Technology, Chinese Academy of Science",
      "position": "AI Intern, Research Assistant",
      "url": "",
      "startDate": "2024-08-01",
      "endDate": "2025-01-01",
      "summary": "Contributed to the training and deployment of Visual-Language Models (VLM) for satellite remote sensing imagery. Responsibilities included optimizing super-resolution imaging, developing cross-domain matching models, enabling adaptive resolution, and building a high-quality image-text dataset.",
      "highlights": [
        "Contributed deeply to the training and fine-tuning of Visual-Language Models (VLM), successfully deploying features such as Image-Text Description, High-Precision Object Detection, and Multi-Turn Visual Q&A in multiple systems.",
        "Reproduced and optimized state-of-the-art Super-Resolution Imaging Technology, achieving multi-dimensional ultra-heterogeneous image alignment and denoising for multi-spectral low-resolution images.",
        "Utilized CLIP and Multi-Classification Models to achieve Cross-Domain Matching and Label Association for physical objects across multi-source, multi-resolution remote sensing images, significantly improving data utilization efficiency.",
        "Enabled satellites to adaptively enhance imaging resolution under complex observation conditions, achieving the image quality standard required for critical business decision-making.",
        "Developed an End-to-End Network integrating Edge Enhancement, Super-Resolution Generative Adversarial Networks (SR-GANs), and Object Detection to significantly improve terminal object detection performance.",
        "Designed and experimented with advanced fusion modules, including Transformer Encoders and 3D Convolution, for Multi-Source Ordered Remote Sensing Data Streams, establishing a systematic data feedback mechanism to enhance feature capture ability.",
        "Constructed a large-scale, high-quality Image-Text Pair Dataset for Satellite Remote Sensing Visual-Language Model (VLM) training, sourced from high-noise, multi-semantic, and unstructured natural language files."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Imperial College London",
      "location": "London, UK",
      "url": "",
      "area": "Applied Computational Science and Engineering",
      "studyType": "M.S.",
      "startDate": "2025-09-01",
      "endDate": "2026-09-01",
      "score": "",
      "courses": [
        "Applied Computation",
        "Data Science and Machine Learning",
        "Modelling and Numerical Methods",
        "Inversion and Optimization",
        "Parallel Programming"
      ]
    },
    {
      "institution": "Donghua University",
      "location": "Shanghai, China",
      "url": "",
      "area": "Data Science and Big Data Technology",
      "studyType": "B.S.",
      "startDate": "2021-09-01",
      "endDate": "2025-06-01",
      "score": "90.1/100",
      "courses": [
        "Deep Learning",
        "Algorithom and Data Structures",
        "Calculus",
        "Linear Algebra",
        "Probability and Mathematical Statistics"
      ]
    }
  ],
  "awards": [
    {
      "title": "National Second Prize",
      "date": "2024-05-01",
      "awarder": "Chinese Collegiate Computing Competition (4C)",
      "summary": "Awarded for the 'Online Education Big Data Analysis Platform with Integrated Specialized LLM' project."
    },
    {
      "title": "First Prize",
      "date": "2024-05-01",
      "awarder": "Shanghai Collegiate Application Technology Competition",
      "summary": "Awarded for the 'Online Education Big Data Analysis Platform with Integrated Specialized LLM' project (Enterprise Cooperation Track)."
    },
    {
      "title": "National-Level Project",
      "date": "2024-06-01",
      "awarder": "Undergraduate Innovation and Entrepreneurship Program",
      "summary": "Awarded for the 'Automatic Annotation System for Cervical Liquid-based Pathology Images' project."
    },
    {
      "title": "1st Place in Model Metrics",
      "date": "2023-12-01",
      "awarder": "Shanghai AI Lab DIMTAIC 2023 Segmentation Competition",
      "summary": "Achieved first place for the 'Visual Enhanced 2.5D 3D Image Deep Learning Segmentation Algorithm Mechanisms' research."
    },
    {
      "title": "Software Copyright",
      "date": "2023-04-01",
      "awarder": "National Copyright Administration",
      "summary": "Secured for the 'LinkMemo: Graph-based Vocabulary Learning System' project."
    }
  ],
  "certificates": [],
  "publications": [
    {
      "name": "Multi-Modal Solution: Deepfake Detection and the Source Identification",
      "publisher": "PMBDA 2023",
      "releaseDate": "2023-12-15",
      "url": "https://doi.org/10.4108/eai.15-12-2023.2345299",
      "summary": "Co-first author. Co-developed a Multi-Modal Deepfake Detection and Identity Authentication Framework, integrating a Cross-Modal Attention Mechanism, Face Recognition, Audio Feature Engineering, and Physical Anomaly Features to enhance detection accuracy and robustness."
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "Proficient",
      "icon": "",
      "keywords": [
        "Python",
        "JAVA",
        "C++"
      ]
    },
    {
      "name": "Deep Learning Frameworks",
      "level": "Proficient",
      "icon": "",
      "keywords": [
        "Pytorch",
        "TensorFlow"
      ]
    },
    {
      "name": "Big Data Technologies",
      "level": "Proficient",
      "icon": "",
      "keywords": [
        "Hadoop",
        "Spark"
      ]
    },
    {
      "name": "Database Operations",
      "level": "Proficient",
      "icon": "",
      "keywords": [
        "SQL",
        "Dameng Assistant Engineer (DAE)"
      ]
    },
    {
      "name": "Other",
      "level": "Proficient",
      "icon": "",
      "keywords": [
        "Linux system operation",
        "Docker"
      ]
    }
  ],
  "languages": [],
  "interests": [],
  "references": [],
  "projects": [
    {
      "name": "Online Education Big Data Analysis Platform with Integrated Specialized LLM",
      "summary": "As Group Leader, developed a platform leveraging a Text2SQL LLM for natural language querying of educational data. Implemented a RAG system with OpenAI Whisper to ensure reliability, deployed a ChatGLM3-6B model as a conversational assistant, and used Hadoop and Spark for large-scale data processing.",
      "highlights": [
        "National Second Prize in the Chinese Collegiate Computing Competition (4C)",
        "First Prize in the Shanghai Collegiate Application Technology Competition"
      ],
      "startDate": "2024-02-01",
      "endDate": "2024-05-01",
      "url": ""
    },
    {
      "name": "Automatic Annotation System for Cervical Liquid-based Pathology Images",
      "summary": "As Group Leader, developed a system using Deformable Convolution and Spatial Attention for cervical cell detection. Fine-tuned and deployed a LLaMA medical assistant model and utilized Domain Adaptation Networks (DAN) to address the domain shift problem between data from different hospitals.",
      "highlights": [
        "Awarded as a National-Level project in the Undergraduate Innovation and Entrepreneurship Program"
      ],
      "startDate": "2023-03-01",
      "endDate": "2024-06-01",
      "url": ""
    },
    {
      "name": "Visual Enhanced 2.5D 3D Image Deep Learning Segmentation Algorithm Mechanisms",
      "summary": "As Research Leader, proposed a novel visual enhanced perception mechanism using a dynamic gating structure for 3D medical images. Introduced an improved 2.5D data structure with a channel attention mechanism to achieve lightweight and high-semantic spatial expression, reducing computational costs.",
      "highlights": [
        "1st Place in Model Metrics in Shanghai AI Lab DIMTAIC 2023 Segmentation Competition",
        "Invited Participant at the 2023 Health China Sinan Summit"
      ],
      "startDate": "2023-08-01",
      "endDate": "2023-12-01",
      "url": ""
    },
    {
        "name": "Multi-modal Solution: Deepfake Detection and the Source Identification",
        "summary": "As Co-first Author, co-developed a multi-modal framework integrating cross-modal attention, face recognition, and audio features to improve detection accuracy. Supervised by Prof. David Woodruff of Carnegie Mellon University.",
        "highlights": [
            "Published in PMBDA 2023"
        ],
        "startDate": "2023-07-01",
        "endDate": "2023-10-01",
        "url": "https://doi.org/10.4108/eai.15-12-2023.2345299"
    },
    {
      "name": "3D Gaussian Splatting for Visual Computing",
      "summary": "Implemented the 3D Gaussian Splatting (3DGS) algorithm for applications including novel view synthesis, SLAM, and pose estimation. Additionally, developed a 3D simulated physical engine for object collision.",
      "highlights": [],
      "startDate": "2024-02-01",
      "endDate": "2024-05-01",
      "url": ""
    },
    {
      "name": "LinkMemo: Graph-based Vocabulary Learning System",
      "summary": "Developed and deployed a full-stack vocabulary learning website using Spring Boot, Vue.js, and a Neo4j graph database. The system manages complex word associations via a knowledge graph and implements customizable learning paths.",
      "highlights": [
        "Secured National Copyright Administration Software Copyright"
      ],
      "startDate": "2023-02-01",
      "endDate": "2023-04-01",
      "url": ""
    }
  ]
}